Conf.Simple/src/InformationRegisters/SUI_РезультатыОбработкиВходящихСообщенийОбменаДанными/SUI_РезультатыОбработкиВходящихСообщенийОбменаДанными.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>SUI_РезультатыОбработкиВходящихСообщенийОбменаДанными</name>
  <resources>
    <name>Обработано</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>Статус</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>Сообщения</name>
    <type>
      <types>ValueStorage</types>
    </type>
  </resources>
  <resources>
    <name>КраткоеПредставлениеОшибки</name>
    <type>
      <types>String</types>
    </type>
  </resources>
  <resources>
    <name>ПодробноеПредставлениеОшибки</name>
    <type>
      <types>String</types>
    </type>
  </resources>
  <attributes>
    <name>ДатаЗаписи</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>СообщениеОбменаДанными</name>
    <type>
      <types>ValueStorage</types>
    </type>
  </attributes>
  <dimensions>
    <name>ID</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>40</length>
      </stringQualifiers>
    </type>
  </dimensions>
</mdclass:InformationRegister>

Conf.Simple/src/InformationRegisters/SUI_СообщенияОбменаДанными/SUI_СообщенияОбменаДанными.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>SUI_СообщенияОбменаДанными</name>
  <resources>
    <name>Данные</name>
    <type>
      <types>ValueStorage</types>
    </type>
  </resources>
  <attributes>
    <name>ВидДанных</name>
    <type>
      <types>EnumRef.SUI_ВидыДанныхСообщенийОбменаДанными</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаЗаписи</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>МеткаВремени</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>30</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Приоритет</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>1</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Сворачивать</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Ключи</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>500</length>
      </stringQualifiers>
    </type>
  </attributes>
  <dimensions>
    <name>ID</name>
    <comment>Идентификатор сообщения</comment>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>40</length>
      </stringQualifiers>
    </type>
  </dimensions>
  <dimensions>
    <name>Отправитель</name>
    <type>
      <types>ExchangePlanRef.SUI_МобильныеУстройства</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Получатель</name>
    <type>
      <types>ExchangePlanRef.SUI_МобильныеУстройства</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

Conf.Simple/src/InformationRegisters/SUI_РезультатыОбработкиВходящихСообщенийОбменаДанными/ManagerModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

//@skip-check bsl-variable-name-invalid
#Область ПрограммныйИнтерфейс

// Структура результата обработки.
// 
// Параметры:
//  ID - Строка - Идентификатор обрабатываемого сообщения
//  Владелец - ПланОбменаСсылка.SUI_МобильныеУстройства - Владелец обрабатываемого сообщения
// 
// Возвращаемое значение:
//  Структура - Структура результата обработки:
// * ID - Строка - Идентификатор обрабатываемого сообщения
// * Владелец - ПланОбменаСсылка.SUI_МобильныеУстройства - Владелец обрабатываемого сообщения
// * Обработано - Булево - Признак обработки сообщения
// * Статус - Строка - Статус обработки
// * Сообщения - Массив из Строка - Массив сообщения
// * КраткоеПредставлениеОшибки - Строка - Краткое представление ошибки обработки
// * ПодробноеПредставлениеОшибки - Строка - Подробное представление ошибки обработки
Функция СтруктураРезультатаОбработки(ID = Неопределено) Экспорт
	
	РезультатаОбработки = Новый Структура();
	
	РезультатаОбработки.Вставить("ID", 							ID);
	РезультатаОбработки.Вставить("Обработано", 					Ложь);
	РезультатаОбработки.Вставить("Статус", 						"");
	РезультатаОбработки.Вставить("Сообщения", 					Новый Массив());
	РезультатаОбработки.Вставить("КраткоеПредставлениеОшибки", 	"");
	РезультатаОбработки.Вставить("ПодробноеПредставлениеОшибки","");
	
	//@skip-check constructor-function-return-section
	Возврат РезультатаОбработки;
	
КонецФункции

Процедура Зафиксировать(Знач Результат, УдалитьСообщение = Истина) Экспорт
	
	НачатьТранзакцию();
	
	Попытка
		
		Результат = ПодготовитьРезультат(Результат);
		
		Если ПолучитьФункциональнуюОпцию("SUI_СрокХраненияРезультатовОбработкиВходящихСообщенийОбмена") > 0 Тогда
			
			МенеджерЗаписи = СоздатьМенеджерЗаписи();
			ЗаполнитьЗначенияСвойств(МенеджерЗаписи, Результат);
			
			ОбщегоНазначенияКлиентСервер.Проверить(Не ПустаяСтрока(МенеджерЗаписи.ID),
				НСтр("ru = 'Не заполнен ID сообщения обработки результата'"),
				"РегистрыСведений.SUI_РезультатыОбработкиВходящихСообщенийОбменаДанными.Зафиксировать");
			
			МенеджерЗаписи.Записать(Истина);
		
		КонецЕсли;
		
		Если УдалитьСообщение Тогда
			РегистрыСведений.SUI_СообщенияОбменаДанными.Удалить(Результат.ID);
		КонецЕсли;
		
		ЗафиксироватьТранзакцию();
		
	Исключение
		ОтменитьТранзакцию();
		ВызватьИсключение;
	КонецПопытки;
	
КонецПроцедуры

Функция ПолучитьРезультат(ID, УдалитьПриПолучении = Истина) Экспорт
	
	ДанныеРезультата = Неопределено;
	
	Запрос = Новый Запрос;
	Запрос.Текст =
		"ВЫБРАТЬ
		|	ЕСТЬNULL(Результаты.ID, СообщенияОбменаДанными.ID) КАК messageID,
		|	ЕСТЬNULL(Результаты.Обработано, ЛОЖЬ) КАК processed,
		|	ЕСТЬNULL(Результаты.Статус, СообщенияОбменаДанными.Статус) КАК status,
		|	ЕСТЬNULL(Результаты.Сообщения, НЕОПРЕДЕЛЕНО) КАК messages,
		|	ЕСТЬNULL(Результаты.КраткоеПредставлениеОшибки, """") КАК error,
		|	ЕСТЬNULL(Результаты.ДатаЗаписи, ДАТАВРЕМЯ(1, 1, 1)) КАК date
		|ИЗ
		|	(ВЫБРАТЬ ПЕРВЫЕ 1
		|		Результаты.ID,
		|		Результаты.Обработано,
		|		ВЫБОР
		|			КОГДА Результаты.Статус = ""Выполнено""
		|				ТОГДА ""done""
		|			КОГДА Результаты.Статус = ""Выполняется""
		|				ТОГДА ""in progress""
		|			КОГДА Результаты.Статус = ""Ошибка""
		|				ТОГДА ""error""
		|			КОГДА Результаты.Статус = ""Отменено""
		|				ТОГДА ""cancelled""
		|			ИНАЧЕ Результаты.Статус
		|		КОНЕЦ КАК Статус,
		|		Результаты.Сообщения,
		|		Результаты.КраткоеПредставлениеОшибки,
		|		Результаты.ДатаЗаписи
		|	ИЗ
		|		РегистрСведений.SUI_РезультатыОбработкиВходящихСообщенийОбменаДанными КАК Результаты
		|	ГДЕ
		|		Результаты.ID = &ID) КАК Результаты
		|		ПОЛНОЕ СОЕДИНЕНИЕ (ВЫБРАТЬ ПЕРВЫЕ 1
		|			СообщенияОбменаДанными.ID,
		|			""not processed"" КАК Статус
		|		ИЗ
		|			РегистрСведений.SUI_СообщенияОбменаДанными КАК СообщенияОбменаДанными
		|		ГДЕ
		|			СообщенияОбменаДанными.ID = &ID) КАК СообщенияОбменаДанными
		|		ПО (Результаты.ID = СообщенияОбменаДанными.ID)";
	
	Запрос.УстановитьПараметр("ID", ID);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Если Не РезультатЗапроса.Пустой() Тогда
		
		Выборка = РезультатЗапроса.Выбрать();
		Выборка.Следующий();
		
		ОписаниеТипаМассив = Новый ОписаниеТипов("Массив");
		
		ДанныеРезультата = SUI_ОбщегоНазначения.СтрокаТаблицыЗначенийВСтруктуру(Выборка);
		
		Если ДанныеРезультата.messages <> Неопределено Тогда
			ДанныеРезультата.messages = ДанныеРезультата.messages.Получить();
		КонецЕсли;
		
		ДанныеРезультата.messages = ОписаниеТипаМассив.ПривестиЗначение(ДанныеРезультата.messages);
		
		Если УдалитьПриПолучении И Выборка.messages <> Неопределено Тогда
			УдалитьРезультат(ДанныеРезультата.messageID);
		КонецЕсли;
		
	КонецЕсли;
	
	Возврат ДанныеРезультата;
	
КонецФункции

Процедура УдалитьРезультат(ID) Экспорт
	
	НаборЗаписей = СоздатьНаборЗаписей();
	НаборЗаписей.Отбор.ID.Установить(ID);
	НаборЗаписей.Записать(Истина);
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныйПрограммныйИнтерфейс

Функция ПолучитьРезультатЗапросаУстаревшихРезультатов() Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст =
		"ВЫБРАТЬ ПЕРВЫЕ 1000
		|	Результаты.ID
		|ИЗ
		|	РегистрСведений.SUI_РезультатыОбработкиВходящихСообщенийОбменаДанными КАК Результаты
		|ГДЕ
		|	Результаты.ДатаЗаписи < &ПредельнаяДата";
	
	Запрос.УстановитьПараметр("ПредельнаяДата", 
		ТекущаяДатаСеанса() - 60 * 60 * 24 * ПолучитьФункциональнуюОпцию("SUI_СрокХраненияРезультатовОбработкиВходящихСообщенийОбмена"));
	
	Возврат Запрос.Выполнить();
	
КонецФункции

Процедура ВыполнитьОчисткуУстаревшихРезультатов(Параметры, АдресРезультата) Экспорт
	
	РезультатЗапроса = ПолучитьРезультатЗапросаУстаревшихРезультатов();
	
	Пока Не РезультатЗапроса.Пустой() Цикл
		
		НачатьТранзакцию();
		
		Попытка
			
			Блокировка = Новый БлокировкаДанных;
			ЭлементБлокировки = Блокировка.Добавить("РегистрСведений.SUI_РезультатыОбработкиВходящихСообщенийОбменаДанными");
			ЭлементБлокировки.Режим = РежимБлокировкиДанных.Разделяемый;
			ЭлементБлокировки.ИсточникДанных = РезультатЗапроса;
			ЭлементБлокировки.ИспользоватьИзИсточникаДанных("ID", "ID");
			Блокировка.Заблокировать();
			
			Выборка = РезультатЗапроса.Выбрать();
			
			Пока Выборка.Следующий() Цикл
				УдалитьРезультат(Выборка.ID);
			КонецЦикла;
			
			ЗафиксироватьТранзакцию();
			
		Исключение
			ОтменитьТранзакцию();
			ВызватьИсключение;
		КонецПопытки;
		
		//@skip-check query-in-loop
		РезультатЗапроса = ПолучитьРезультатЗапросаУстаревшихРезультатов();
		
	КонецЦикла;
	
	// Результат не требуется
	Если ЭтоАдресВременногоХранилища(SUI_ОбщегоНазначения.ОписаниеТипаСтрока(0).ПривестиЗначение(АдресРезультата)) Тогда
		УдалитьИзВременногоХранилища(АдресРезультата);
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Функция ПодготовитьРезультат(Результат)
	
	ОписаниеТипаСтруктура = Новый ОписаниеТипов("Структура");
	ОбработанныйРезультат = СтруктураРезультатаОбработки();
	ЗаполнитьЗначенияСвойств(ОбработанныйРезультат, ОписаниеТипаСтруктура.ПривестиЗначение(Результат));
	
	//@skip-check bsl-legacy-check-expression-type
	ОбработанныйРезультат.Сообщения = Новый ХранилищеЗначения(SUI_ОбщегоНазначенияКлиентСервер.СвойствоСтруктуры(
		ОбработанныйРезультат, "Сообщения", Новый Массив(), Тип("Массив")), Новый СжатиеДанных(9));
	
	Возврат ОбработанныйРезультат;
	
КонецФункции

#КонецОбласти

#КонецЕсли
